[
  {
    "q": "AWS allows users to manage their resources using a web based user interface. What is the name of this interface?",
    "choices": {
      "a": "AWS CLI.",
      "b": "AWS API.",
      "c": "AWS SDK.",
      "d": "AWS Management Console."
    },
    "number": 1,
    "answer": "d"
  },
  {
    "q": "Which of the following is an example of horizontal scaling in the AWS Cloud?",
    "choices": {
      "a": "Replacing an existing EC2 instance with a larger, more powerful one.",
      "b": "Increasing the compute capacity of a single EC2 instance to address the growing demands of an application.",
      "c": "Adding more RAM capacity to an EC2 instance.",
      "d": "Adding more EC2 instances of the same size to handle an increase in traffic."
    },
    "number": 2,
    "answer": "d"
  },
  {
    "q": "You have noticed that several critical Amazon EC2 instances have been terminated. Which of the following AWS services would help you determine who took this action?",
    "choices": {
      "a": "Amazon Inspector.",
      "b": "AWS CloudTrail.",
      "c": "AWS Trusted Advisor.",
      "d": "EC2 Instance Usage Report."
    },
    "number": 3,
    "answer": "b"
  },
  {
    "q": "Which of the below options are related to the reliability of AWS? (Choose TWO)",
    "choices": {
      "a": "Applying the principle of least privilege to all AWS resources.",
      "b": "**Automatically provisioning new resources to meet demand.",
      "c": "All AWS services are considered Global Services, and this design helps customers serve their international users.",
      "d": "Providing compensation to customers if issues occur.",
      "e": "**Ability to recover quickly from failures."
    },
    "number": 4,
    "answer": "b"
  },
  {
    "q": "Which statement is true regarding the AWS Shared Responsibility Model?",
    "choices": {
      "a": "Responsibilities vary depending on the services used.",
      "b": "Security of the IaaS services is the responsibility of AWS.",
      "c": "Patching the guest OS is always the responsibility of AWS.",
      "d": "Security of the managed services is the responsibility of the customer."
    },
    "number": 5,
    "answer": "a"
  },
  {
    "q": "**You have set up consolidated billing for several AWS accounts. One of the accounts has purchased a number of reserved instances for 3 years. Which of the following is true regarding this scenario?",
    "choices": {
      "a": "The Reserved Instance discounts can only be shared with the master account.",
      "b": "All accounts can receive the hourly cost benefit of the Reserved Instances (Connect).",
      "c": "The purchased instances will have better performance than On-demand instances.",
      "d": "There are no cost benefits from using consolidated billing; It is for informational purposes only."
    },
    "number": 6,
    "answer": {"1":"a", "2":"b"}
  },
  {
    "q": "**A company has developed an eCommerce web application in AWS. What should they do to ensure that the application has the highest level of availability?",
    "choices": {
      "a": "Deploy the application across multiple Availability Zones and Edge locations.",
      "b": "Deploy the application across multiple Availability Zones and subnets.",
      "c": "Deploy the application across multiple Regions and Availability Zones (Co).",
      "d": "Deploy the application across multiple VPC's and subnets."
    },
    "number": 7,
    "answer": {"1":"a", "2":"b"}
  },
  {
    "q": "**What does AWS Snowball provide? (Choose TWO)",
    "choices": {
      "a": "Built-in computing capabilities that allow customers to process data locally.",
      "b": "A catalog of third-party software solutions that customers need to build solutions and run their businesses.",
      "c": "A hybrid cloud storage between on-premises environments and the AWS Cloud.",
      "d": "An Exabyte-scale data transfer service that allows you to move extremely large amounts of data to AWS.",
      "e": "Secure transfer of large amounts of data into and out of the AWS."
    },
    "number": 8,
    "answer": {"1":"a", "2":"b"}
   

  },
  {
    "q": "**A company has an AWS Enterprise Support plan. They want quick and efficient guidance with their billing and account inquiries. Which of the following should the company use?",
    "choices": {
      "a": "AWS Health Dashboard.",
      "b": "AWS Support Concierge.",
      "c": "AWS Customer Service.",
      "d": "AWS Operations Support."
    },
    "number": 9,
    "answer": {"1":"a", "2":"b"}
  },
  {
    "q": "**A Japanese company hosts their applications on Amazon EC2 instances in the Tokyo Region. The company has opened new branches in the United States, and the US users are complaining of high latency. What can the company do to reduce latency for the users in the US while minimizing costs?",
    "choices": {
      "a": "Applying the Amazon Connect latency-based routing policy.",
      "b": "Registering a new US domain name to serve the users in the US.",
      "c": "Building a new data center in the US and implementing a hybrid model.",
      "d": "Deploying new Amazon EC2 instances in a Region located in the US."
    },
    "number": 10,
    "answer": {"1":"a", "2":"b"}
  }
  
]